xively/xively-client-c/examples/cc3200/xively_firmware_updates/SFT/xi_sft_client.c
/*  Copyright (c) 2003-2017, LogMeIn, Inc. All rights reserved.
    This is part of Xively C library. */

#include <xively.h>
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include "../cbor/cbor.h"
#include "../cbor/cn-cbor/cn-cbor.h"
#include "../sha256/sha256.h"
#include "xi_sft.h"

/* Simpelink EXT lib includes */
#include "flc_api.h"

#include "hw_memmap.h"
#include "hw_common_reg.h"
#include "hw_types.h"
#include "hw_ints.h"
#include "interrupt.h"
#include "rom.h"
#include "rom_map.h"
#include "uart.h"
#include "prcm.h"
#include "utils.h"
#include "gpio.h"
#include "gpio_if.h"

#include "uart_if.h"
#define  UART_PRINT  Report
#undef   printf
#define  printf      Report

///// Test these individually
#define MAX_INCOMING_FILENAME_LENGTH 50
#define MAX_STRING_LENGTH 50

/*
 * TYPEDEFS
 */
typedef unsigned char uchar;
typedef unsigned int uint;

typedef enum
{
    sft_status_ok = 0,                  /* 0 */
    sft_unsupported_protocol_version,   /* 1 */
    sft_open_file_error,                /* 2 */
    sft_close_file_error,               /* 3 */
    sft_write_error,                    /* 4 */
    sft_empty_length_array_error,       /* 5 */
    sft_data_out_of_bounds_error,       /* 6 */
    sft_missing_cbor_field_error,       /* 7 */
    sft_publish_error,                  /* 8 */
    sft_fingerprint_mismatch_error,     /* 9 */
    sft_unexpected_filename_error,      /* 10 */
    sft_cbor_encoding_error,            /* 11 */
    sft_fingerprint_too_large_error,    /* 12 */
    sft_internal_error,                 /* 13 */
    sft_offset_error,                   /* 14 */
    sft_cbor_error_field_set_error,     /* 15 */

    sft_status_max

} sft_status_t;

typedef struct file_download_ctx_s
{
    int file_length;
    int file_storage_offset;
    sft_status_t result;

    long file_handle;
    unsigned long file_token;

    char file_name[MAX_STRING_LENGTH];
    char file_revision[MAX_STRING_LENGTH];
    unsigned char file_sft_fingerprint_str[65];
    unsigned char file_local_computed_fingerprint[32];

    SHA256_CTX sha256_context;

} file_download_ctx_t;

typedef struct xi_sft_file_chunk_s
{
    uint offset;
    uint chunk_length;
    uint array_length;
    uint status;
    unsigned char* byte_array;
} xi_sft_file_chunk_t;

/*
 * VARIABLES
 */
int downloading = 0;

int tenpercent = 0;
int currenttenpercent = 0;

char firmware_filename[] = "firmware";
char firmware_revision[] = "1.0";

file_download_ctx_t download_context;

char buffer[400];

#define MESSAGESIZE 50
char message[MESSAGESIZE];
#define LOGDETAILSSIZE 400

/* Buffers to hold the formatted topics.
 * Topics are mangled by account and device ids.
 */
char xi_stopic[128];
char xi_logtopic[128];
char xi_ctopic[128];

const char* sft_status_strings[] =
{
    "sft_status_ok",                        /* 0 */
    "sft_unsupported_protocol_version",     /* 1 */
    "sft_open_file_error",                  /* 2 */
    "sft_close_file_error",                 /* 3 */
    "sft_write_error",                      /* 4 */
    "sft_empty_length_array_error",         /* 5 */
    "sft_data_out_of_bounds_error",         /* 6 */
    "sft_missing_cbor_field_error",         /* 7 */
    "sft_publish_error",                    /* 8 */
    "sft_fingerprint_mismatch_error",       /* 9 */
    "sft_unexpected_filename_error",        /* 10 */
    "sft_cbor_encoding_error",              /* 11 */
    "sft_fingerprint_too_large_error",      /* 12 */
    "sft_internal_error",                   /* 13 */
    "sft_offset_error",                     /* 14 */
    "sft_cbor_error_field_set_error",       /* 15 */

    "SFT_MAX_ERROR"
};

/*
 *  Function Declarations
 */

int xi_sft_init( xi_context_handle_t in_context_handle, char *account_id, char *device_id );
void on_sft_message( xi_context_handle_t in_context_handle, xi_sub_call_type_t call_type,
                            const xi_sub_call_params_t* const params, xi_state_t state, void* user_data );

/* incoming message handling functions */
void xi_process_file_chunk( xi_context_handle_t in_context_handle, cn_cbor* in_cb );
void xi_parse_file_update_available( xi_context_handle_t in_context_handle, cn_cbor *cb );
void xi_parse_file_chunk( xi_context_handle_t in_context_handle, cn_cbor* in_cb, xi_sft_file_chunk_t* out_sft_file_chunk );

/* outgoing message formating and publication functions */
void xi_publish_file_info( xi_context_handle_t in_context_handle );
void xi_publish_file_chunk_request( xi_context_handle_t in_context_handle, const char* file_name, const char* file_revision, int offset );

/* Error Handling Functions */
void xi_set_sft_error( sft_status_t status );
void xi_missing_cbor_field_error( xi_context_handle_t in_context_handle, const char* cbor_message_name, const char* field_name );

/* Device Log Functions */
void xi_publish_device_log( xi_context_handle_t in_context_handle, const char* message_str, const char* details_str, const sft_status_t status );
void xi_publish_device_log_format_int( xi_context_handle_t in_context_handle, const char* message_str, const char* details_str, const int value_int,
                                  const sft_status_t status );
void xi_publish_device_log_format_int_int( xi_context_handle_t in_context_handle, const char* message_str, const char* details_str,
                                      const int value_int1, const int value_int2, const sft_status_t status );
void xi_publish_device_log_format_str( xi_context_handle_t in_context_handle, const char* message_str, const char* details_str, const char* value_str,
                                  const sft_status_t status );
void xi_publish_device_log_format_str_str( xi_context_handle_t in_context_handle, const char* message_str, const char* details_str,
                                      const char* value_str1, const char* value_str2, const sft_status_t status );

/* Output Utility Functions */
void print_hash( unsigned char hash[] );



int xi_sft_init( xi_context_handle_t in_context_handle, char *account_id, char *device_id )
{
    /* Accept the latest firmware if we get here. */
    if( sl_extlib_FlcIsPendingCommit() )
    {
        printf("******************* Committing this revision\n");
        sl_extlib_FlcCommit( FLC_COMMITED );
    }

    if( NULL == account_id || NULL == device_id )
    {
        return -1;
    }

    /* xi_stopic is the MQTT topic we PUB to to send messages to the broker. */
    snprintf(xi_stopic, sizeof(xi_stopic),"xi/ctrl/v1/%s/svc", device_id);

