xively/xively-client-c/examples/cc3200/xively_firmware_updates/SFT/xi_sft_client.c
    /* xi_ctopic is the MQTT topic we SUBSCRIBE to to receive messages from the broker. */
    snprintf(xi_ctopic, sizeof(xi_ctopic),"xi/ctrl/v1/%s/cln", device_id);

    /* xi_logtopic is the MQTT topic we PUB to to add log messages. */
    snprintf(xi_logtopic, sizeof(xi_logtopic),"xi/blue/v1/%s/d/%s/_log",account_id, device_id);

    /* Everything interesting happens in the on_sft_message() state machine. */
    void* user_data = NULL;
    xi_subscribe(in_context_handle, xi_ctopic, XI_MQTT_QOS_AT_MOST_ONCE, on_sft_message, user_data );

    return 0;
}




/* Reboot the device
 * This is invoked through a timed task from the xively client after the
 * file download is complete
 */
static void reboot_mcu( const xi_context_handle_t in_context_handle,
                        const xi_timed_task_handle_t timed_task_handle,
                        void* user_data )
{
  /* Configure hibernate RTC wakeup */
  PRCMHibernateWakeupSourceEnable( PRCM_HIB_SLOW_CLK_CTR );

  /* Delay loop */
  MAP_UtilsDelay( 8000000 );

  /* Set wake up time */
  PRCMHibernateIntervalSet( 330 );

  /* Request hibernate */
  PRCMHibernateEnter();

  /* Control should never reach here */
  while( 1 )
  {  }
}



/* Converts the locally computed hash into a string
 * and compares it to the SFT hash string 'fingerprint'
 * that we received during the FILE_UPDATE_AVAILABLE message.
 * Reports an error to Device Logs if there's a mis match,
 * and marks the error state.
 */
void verify_sha256( xi_context_handle_t in_context_handle )
{
    /* Finalize SHA256 Digest */
    sha256_final( &download_context.sha256_context, download_context.file_local_computed_fingerprint );
    printf( "Calculated hash = 0x" );
    print_hash( download_context.file_local_computed_fingerprint );

    char local_fingerprint_str[65];
    char* buff_ptr = local_fingerprint_str;

    /* convert binary to a string matching SFT fingprint format */
    int i;
    for( i = 0; i < 32; ++i )
    {
        buff_ptr += sprintf( buff_ptr, "%02x", download_context.file_local_computed_fingerprint[i] );
    }

    /* null terminate the string */
    *buff_ptr = '\0';

    /* are they the same? If not then raise the red flag */
    if( 0 != strncmp( local_fingerprint_str, download_context.file_sft_fingerprint_str, 64 ) )
    {
        printf("File Update Fingerprint mismatch.  SFT Fingerprint: %s  device-calculated fingerprint: %s\n",
               download_context.file_sft_fingerprint_str, local_fingerprint_str );
        xi_set_sft_error( sft_fingerprint_mismatch_error );
        xi_publish_device_log_format_str_str( in_context_handle, "File Update Fingerprint Mismatch",
                                              "sft fingerprint: %s device-calculated fingerprint: %s ",
                                              download_context.file_sft_fingerprint_str, local_fingerprint_str,
                                              sft_fingerprint_mismatch_error );
        return;
    }
}

void on_sft_message( xi_context_handle_t in_context_handle,
                            xi_sub_call_type_t call_type,
                            const xi_sub_call_params_t* const params,
                            xi_state_t state,
                            void* user_data )
{
    cn_cbor* cb = NULL;
    char* bufptr = NULL;
    cn_cbor* cb_item = NULL;
    const uint8_t* payload_data = NULL;
    size_t payload_length = 0;

    switch ( call_type )
    {
        case XI_SUB_CALL_SUBACK:
            if ( params->suback.suback_status == XI_MQTT_SUBACK_FAILED )
            {
                printf( "topic:%s. Subscription failed.\n", params->suback.topic );
            }
            else
            {
                printf( "topic:%s. Subscription granted %d.\n", params->suback.topic,
                        ( int )params->suback.suback_status );
            }
            return;
        case XI_SUB_CALL_MESSAGE:

            /* get the payload parameter that contains the data that was sent. */
            payload_data = params->message.temporary_payload_data;
            payload_length = params->message.temporary_payload_data_length;

            /* Figure out what the packet type is and then call the appropriate parser */
            cb = cn_cbor_decode( payload_data, payload_length, 0 );

            if (cb) {
#ifdef XI_DEBUGSFT
                dump(cb, buffer, &bufend, 0);
                *bufend = 0;
                printf("%s\n", buffer);
#endif

                cb_item = cn_cbor_mapget_string(cb, "msgtype");
                if(cb_item)
                {
                    switch(cb_item->v.uint)
                    {
                        case XI_FILE_UPDATE_AVAILABLE:

							printf("Got FILE_UPDATE_AVAILABLE\n");
							if( downloading )
							{
							    printf("WARNING: ALREADY DOWNLOADING!\n");
							    cn_cbor_free(cb CBOR_CONTEXT_PARAM);
							    break;
							}

                            /* Parse FILE_UPDATE_AVAILABLE messsage
                             * and format GET_FILE_CHUNK message into the outgoing cbor buffer `encoded` */
                            xi_parse_file_update_available( in_context_handle, cb );

                            /* Free the incoming cbor message context */
                            cn_cbor_free(cb CBOR_CONTEXT_PARAM);

                            if( sft_status_ok == download_context.result )
                            {
                                /* Open the file for writing */
                                int open_file_result =  sl_extlib_FlcOpenFile("/sys/mcuimgA.bin", download_context.file_length,
                                                                              &download_context.file_token, &download_context.file_handle,
                                                                              FS_MODE_OPEN_WRITE );

                                /* Check for errors */
                                if( open_file_result < 0 )
                                {
                                    printf(" ERROR: mcuimgA.bin open returned %d\n", open_file_result );
                                    xi_set_sft_error( sft_open_file_error );
                                    xi_publish_device_log_format_int( in_context_handle, "File update, open failed",
                                                                      "FlcOpenFile returned: %d",
                                                                      open_file_result, sft_open_file_error );
                                }
                            }
                            break;

