xively/xively-client-c/examples/cc3200/xively_firmware_updates/SFT/xi_sft_client.c
					case XI_FILE_CHUNK:

					        /* Received a file chunk message.  Make sure that we're not in an error state
					         * before processing the message.  */
					        if( sft_status_ok == download_context.result )
					        {
	                            /* Parse the FILE_CHUNK message and send another
	                             * FILE_GET_CHUNK request if we're still downloading data */
					            xi_process_file_chunk( in_context_handle, cb );
					        }
					        else
					        {
					            /* we have an error. set download to false.
					             * Note, it might already be false.  This is just for safety. */
					            downloading = 0;
					        }

					        /* Free the incoming cbor message context */
							cn_cbor_free(cb CBOR_CONTEXT_PARAM);

							/* Since we're getting file chunks then we were in a downloading state.
							 * If we're not currently downloading, that means the download finished
							 * or we've encountered an error. */
							if( ! downloading )
							{
							    if( sft_status_ok == download_context.result )
							    {
							        verify_sha256( in_context_handle );
							    }

                                /* Close the firmware file */
                                const int close_files_result = sl_extlib_FlcCloseFile( download_context.file_handle, NULL, NULL, 0 );
                                if(  0 != close_files_result )
                                {
                                    printf( "ERROR: firmware file close via FlcCloseFile result: %d\n", close_files_result );
                                    xi_set_sft_error( sft_close_file_error );
                                    xi_publish_device_log_format_int( in_context_handle, "File update, close failed",
                                                                      "FlcCloseFile returned: %d",
                                                                      close_files_result, sft_open_file_error );
                                }

                                /* Log the download complete information */
                                char log_details[LOGDETAILSSIZE];
                                snprintf( log_details, sizeof( log_details ),
                                          "filename=%s revision=%s length = %d", firmware_filename , download_context.file_revision, download_context.file_length );
                                xi_publish_device_log( in_context_handle, "File download complete.", log_details, download_context.result );

                                printf( "=================\n");
                                printf( "Done downloading.\n");
                                printf( "   result: %d\n", download_context.result );
                                printf( "=================\n");

                                /* Set the bootloader to test the new image */
                                if( download_context.result )
                                {
                                    printf("NOT MARKING FILE TO TEST DUE TO ERRORS\n");
                                }
                                else
                                {
                                    sl_extlib_FlcTest( FLC_TEST_RESET_MCU | FLC_TEST_RESET_MCU_WITH_APP );

                                    /* Schedule a callback to reboot the device to test the image
                                     * We don't do this immediately because we want to give enough time
                                     * for our device log publications to send. */
                                    xi_schedule_timed_task( in_context_handle, reboot_mcu, 3, 0, NULL );
                                }
                            }
                            break;
                        default:
                            break;
                    }
                }

            }
            return;
        default:
            return;
    }
}

void
xi_publish_file_info( xi_context_handle_t in_context_handle )
{
    /* Let's try making a XI_FILE_INFO packet */
    cn_cbor_errback err;
    cn_cbor *cb_map = cn_cbor_map_create( &err );

    cn_cbor_map_put( cb_map, cn_cbor_string_create( "msgtype", &err ),
                     cn_cbor_int_create( XI_FILE_INFO, &err ), &err );

    cn_cbor_map_put( cb_map, cn_cbor_string_create("msgver", &err ),
                     cn_cbor_int_create( 1, &err ), &err );

    cn_cbor *a = cn_cbor_array_create( &err );
    cn_cbor *cb_file1 = cn_cbor_map_create( &err );
    cn_cbor_map_put( cb_file1, cn_cbor_string_create( "N", &err ),
                     cn_cbor_string_create( firmware_filename, &err ), &err );

    cn_cbor_map_put( cb_file1, cn_cbor_string_create( "R", &err ),
                     cn_cbor_string_create( "-1", &err ), &err );

    cn_cbor_array_append( a, cb_file1, &err );
    cn_cbor_map_put( cb_map, cn_cbor_string_create( "list", &err ),
                     a, &err );

    unsigned char encoded[128];
    const ssize_t enc_sz = cn_cbor_encoder_write( encoded, 0, sizeof( encoded ), cb_map );
    cn_cbor_free( cb_map CBOR_CONTEXT_PARAM );

    if( 0 >= enc_sz )
    {
        xi_set_sft_error( sft_cbor_encoding_error );
        xi_publish_device_log_format_int( in_context_handle, "FILE_INFO Encoding Error",
                                          "encoding FILE_INFO cbor error: %d",
                                           enc_sz, sft_cbor_encoding_error );
        return;
    }

    /* publish the FILE_INFO message */
    xi_publish_data( in_context_handle, xi_stopic, encoded, enc_sz, XI_MQTT_QOS_AT_MOST_ONCE,
                     XI_MQTT_RETAIN_FALSE, NULL, NULL );
    printf( "Published FILE_INFO to %s\n",xi_stopic );
}


void xi_parse_file_update_available( xi_context_handle_t in_context_handle, cn_cbor *cb)
{
    cn_cbor *cb_list;
    cn_cbor *cb_item;
    cn_cbor *cb_file;
    int filelistlength = 0;
    int i,index;

    /* Zero out download_context */
    memset( &download_context, 0, sizeof( file_download_ctx_t ) );

    /* Initialize sha256 digest of the file and tracking variables */
    sha256_init( &download_context.sha256_context );

