xively/xively-client-c/examples/cc3200/xively_firmware_updates/SFT/xi_sft_client.c
    /* check message version */
    cb_item = cn_cbor_mapget_string( cb, "msgver" );
    if( cb_item )
    {
        if( 1 != cb_item->v.uint )
        {
            xi_set_sft_error( sft_unsupported_protocol_version );
            xi_publish_device_log_format_int( in_context_handle, "File update available error",
                                              "File Update Available SFT Packet version: %d is unsupported",
                                              cb_item->v.uint, sft_unsupported_protocol_version );
            printf("ERROR: Unsupported FILE_UPDATE_AVIALABLE message version: %d\n", cb_item->v.uint );
            return;
        }
    }

    /* Get the File List.  For this demo it should be only one file */
    cb_list = cn_cbor_mapget_string(cb, "list");
    if(cb_list)
    {
        filelistlength = cb_list->length;
    }

    /* iterate over the file list */
    for( index = 0; index < filelistlength; index++ )
    {
        cb_item = cn_cbor_index(cb_list, index);

        if( cb_item )
        {
        	    /* File 'N'ame */
            cb_file = cn_cbor_mapget_string(cb_item, "N");
            if( cb_file )
            {
                if( strlen( firmware_filename ) != cb_file->length ||
                    strncmp( firmware_filename, cb_file->v.str, cb_file->length ) != 0 )
                {
                    xi_set_sft_error( sft_unexpected_filename_error );
                    xi_publish_device_log( in_context_handle, "File update available error",
                                            "Unexpected filename, expected firmware", sft_unexpected_filename_error );
                    printf( "ERROR: incoming file update has an unexpected name. Expected `firmware`" );
                    return;
                }
            }
            else
            {
                xi_missing_cbor_field_error( in_context_handle, "FILE_UPDATE_AVIALABLE", "N" );
                return;
            }

            /* File 'R'evision */
            cb_file = cn_cbor_mapget_string(cb_item, "R");
            if( cb_file )
            {
                strncpy( download_context.file_revision, cb_file->v.str, sizeof( download_context.file_revision ) );

                if( (unsigned int) cb_file->length < sizeof( download_context.file_revision ) )
                {
                    download_context.file_revision[cb_file->length] = '\0';
                }

                download_context.file_revision[sizeof(download_context.file_revision)-1] = '\0';
            }
            else
            {
                xi_missing_cbor_field_error( in_context_handle, "FILE_UPDATE_AVIALABLE", "R" );
                return;
            }

            /* File 'S'ize */
            cb_file = cn_cbor_mapget_string(cb_item, "S");
            if(cb_file)
            {
                printf( "FILE_UPDATE_AVAILABLE: file length = %d\n",cb_file->v.sint );
                download_context.file_length = cb_file->v.sint;

                /* initialize progress tracking */
                tenpercent = download_context.file_length / 10;
                currenttenpercent = tenpercent;
            }
            else
            {
                xi_missing_cbor_field_error( in_context_handle, "FILE_UPDATE_AVIALABLE", "S" );
                return;
            }

            /* File 'F'ingerprint */
            cb_file = cn_cbor_mapget_string(cb_item, "F");
            if( cb_file )
            {
                if( sizeof( download_context.file_sft_fingerprint_str ) - 1 < cb_file->length )
                {
                    xi_set_sft_error( sft_fingerprint_too_large_error );
                    xi_publish_device_log( in_context_handle, "File update available error",
                                            "Fingerprint size too large.",
                                            sft_fingerprint_too_large_error );
                    printf( "ERROR: incoming fingerprint to large for local storage buffer.");
                }
                else
                {
                    memset( download_context.file_sft_fingerprint_str, '\0',
                            sizeof( download_context.file_sft_fingerprint_str ) );
                    strncpy( download_context.file_sft_fingerprint_str, cb_file->v.str, cb_file->length );
                }
            }
            else
            {
                xi_missing_cbor_field_error( in_context_handle, "FILE_UPDATE_AVIALABLE", "F" );
                return;
            }
        }
        else
        {
            xi_missing_cbor_field_error( in_context_handle, "FILE_UPDATE_AVIALABLE", "list" );
            return;
        }
    }

    /* Log the FILE_UPDATE_AVAILABLE information */
    {
        char log_details_str[LOGDETAILSSIZE];
        snprintf( log_details_str, sizeof( log_details_str ), "name=%s revision=%s length = %d",
                  firmware_filename, download_context.file_revision, download_context.file_length );
        xi_publish_device_log( in_context_handle, "File update available", log_details_str, sft_status_ok );
    }

    /* Set Download State to Active */
    downloading = 1;

    /* Send the Chunk Request */
    xi_publish_file_chunk_request( in_context_handle, firmware_filename, download_context.file_revision,
                                                               download_context.file_storage_offset );
}

/*
 * Formats a FILE_GET_CHUNK cbor message with the provided parameters and then publishes
 * the message to the SFT Service.
 *
 * Returns 0 on success, or -1 if the message could not be queued for publication
 * (probably due to a too-small encoding buffer)
 */
void xi_publish_file_chunk_request( xi_context_handle_t in_context_handle, const char* file_name, const char* file_revision, int offset )
{
    const int message_type = XI_FILE_GET_CHUNK;
    const int message_version = 1;
    const int chunk_length = 1024;

#if 0
    printf( "XI_FILE_GET_CHUNK request params: " );
    printf( "N: \"%s\", ", file_name );
    printf( "R: \"%s\", ", file_revision );
    printf( "O: %d, ", offset );
    printf( "L: %d\n", chunk_length );
#endif

